Revit 2027 API
UnitTypeId.KilonewtonMeters Property
 Kilonewton meters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId KilonewtonMeters { get; }
Public Shared ReadOnly Property KilonewtonMeters As ForgeTypeId
	Get
public:
static property ForgeTypeId^ KilonewtonMeters {
	ForgeTypeId^ get ();
}
static member KilonewtonMeters : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace